{
  "achievements": {
    "assign": [
      {
        "title": "IEEE RGIPT Alumni Selected as Junior Executives at Airports Authority of India",
        "date": "Oct 2024",
        "description": "Congratulations to Abhinav Tripathi, Aman Singh, Basant Kumar, and Shekhar Kumar on their provisional selection as Junior Executives (Electronics) at the Airports Authority of India, marking a proud achievement for IEEE RGIPT Student Branch."
      },
      {
        "title": "IEEE RGIPT Student Branch Wins Best Emerging Student Branch & 1st in Activity Based Incentive Award",
        "date": "Jan 2025",
        "description": "IEEE RGIPT Student Branch was honored with the Best Emerging Student Branch Award and secured 1st position in the Activity Based Incentive Award."
      },
      {
        "title": "IEEE RGIPT Students Reach Top 5 in IIT Bombay Techfest 2024 Meshmerize Competition",
        "date": "Jan 2025",
        "description": "IEEE RGIPT students secured a Top 5 finalist position at the Meshmerize Competition during IIT Bombay Techfest 2024, showcasing innovation, robotics skills, and teamwork."
      },
      {
        "title": "IEEE RGIPT Wins Awards at IEEE UP Section AGM 2025",
        "date": "Jan 2025",
        "description": "IEEE RGIPT Student Branch secured First Place in the Activity-Based Incentive Award and Best Emerging Student Branch Award at the IEEE UP Section AGM 2025, recognizing dedication, teamwork, and innovation."
      },
      {
        "title": "IEEE Student Branch Orientation",
        "date": "11th Feb 2025",
        "description": "The IEEE RGIPT Student Branch successfully conducted its orientation programme for the batch of 2024, introducing new members to the vision, mission, and opportunities within IEEE."
      },
      {
        "title": "Announcement of registration for KodeKurrent",
        "date": "9th Mar 2025",
        "description": "Registration for KodeKurrent Season One had officially started, marking the launch of a 24-hour software hackathon, internship opportunities, and a VLSI workshop."
      },
      {
        "title": "IEEE RGIPT Student Branch's Kode Kurrent Season One - Winners Announcement",
        "date": "23rd Mar 2025",
        "description": "The Champions of KodeX101, KodeX102, and KodeX103 were announced."
      },
      {
        "title": "Expert Session on IoT Applications by Dr. Aditya Singh",
        "date": "2nd Apr 2025",
        "description": "A guest lecture by Dr. Aditya Singh on energy for IoT applications, hosted by IEEE RGIPT Student Branch."
      },
      {
        "title": "Workshop 2.0 – Web Development with Nitesh Saini",
        "date": "6th Apr 2025",
        "description": "An interactive web development workshop covering backend, DevOps, and real-world deployments, hosted by IEEE RGIPT Student Branch and IEEE Computer Society."
      },
      {
        "title": "Workshop 2.0 – Open Source & GitHub with Aayush Kumar",
        "date": "7th Apr 2025",
        "description": "A practical workshop on open source development and version control using Git & GitHub, hosted by IEEE RGIPT Student Branch in collaboration with the IEEE Computer Society."
      },
      {
        "title": "Workshop 2.0 – Computer Society DSA Session (Day 1)",
        "date": "8th Apr 2025",
        "description": "Day 1 of IEEE RGIPT Computer Society Workshop 2.0 focused on DSA fundamentals and problem-solving strategies, conducted by Sunny Kumar and Agastya Yadav."
      },
      {
        "title": "Workshop 2.0 – Computer Society Web Development Session (Day 2)",
        "date": "9th Apr 2025",
        "description": "Day 2 of IEEE RGIPT Computer Society Workshop 2.0 focused on frontend, backend, and full-stack web development, conducted by Nitesh Saini."
      },
      {
        "title": "Workshop 2.0 – Computer Society Open Source Session (Day 3)",
        "date": "10th Apr 2025",
        "description": "Day 3 of IEEE RGIPT Computer Society Workshop 2.0 covered open source fundamentals and hands-on GitHub contributions, conducted by Aayush Kumar."
      },
      {
        "title": "Workshop 2.0 – Machine Learning with Arihant Jain",
        "date": "22nd Apr 2025",
        "description": "An IEEE RGIPT Computer Society workshop introducing foundational ML concepts, algorithms, real-world applications, and career insights, conducted by Arihant Jain."
      },
      {
        "title": "Workshop 2.0 – Augmented & Virtual Reality with Swayanshu Rout",
        "date": "23rd Apr 2025",
        "description": "An IEEE RGIPT Computer Society workshop exploring AR/VR technologies, tools, applications, and industry impact, conducted by Swayanshu Rout."
      },
      {
        "title": "KodeKurrent Season 1 – Internship Winners at Roostoo",
        "date": "May 2025",
        "description": "IEEE RGIPT hackathon participants Adarsh Kumar, Pushkar Raj, Tanish Maheshwari, and Pranesh Sharma secured internships at Roostoo for their outstanding performance."
      },
      {
        "title": "KodeKurrent Season 1 – Prodigal AI Internship Winners",
        "date": "May 2025",
        "description": "Participants of IEEE RGIPT’s KodeKurrent Season 1, including Aayush Kharbanda, Sunny Kumar, and others, earned internships at Prodigal AI for their outstanding performance in the hackathon."
      },
      {
        "title": "Launch of DevWave – CS Skill Up Series 2.0",
        "date": "June 2025",
        "description": "IEEE RGIPT’s DevWave track offers interactive workshops, mentorship, and hands-on projects in software development, UI/UX, web & app design, and product engineering."
      },
      {
        "title": "Launch of CodeNex – CS Skill Up Series 2.0",
        "date": "June 2025",
        "description": "IEEE RGIPT’s CodeNex track provides workshops, coding contests, and mentorship to enhance competitive programming, DSA skills, and placement readiness."
      },
      {
        "title": "Webinar on UI/UX Design with Jitu Raut",
        "date": "June 2025",
        "description": "An exclusive IEEE RGIPT webinar on UI/UX design, featuring Jitu Raut, former Director of Design at Flipkart and CheQ, covering Figma, Framer, and LottieFiles."
      },
      {
        "title": "Jay Kumar Sinha Selected for IEEE India Council SCT 2025",
        "date": "July 2025",
        "description": "IEEE RGIPT congratulates Jay Kumar Sinha for being selected in the Outreach & Partnerships Team of IEEE India Council SCT 2025, recognizing his leadership and dedication."
      },
      {
        "title": "DevWave Web Development Challenge Winners – CS Skill Up Series 2.0",
        "date": "Aug 2025",
        "description": "Winners of the DevWave web development challenge, part of CS Skill Up Series 2.0, were Aadya Agarwal, Ashutosh Sharma, and Vedant Singh, recognized for creativity and technical excellence."
      },
      {
        "title": "CodeNex Challenge Winner – CS Skill Up Series 2.0",
        "date": "Aug 2025",
        "description": "Aadarsh emerged as the winner of CodeNex, the competitive programming challenge under CS Skill Up Series 2.0, demonstrating outstanding problem-solving and coding skills."
      },
      {
        "title": "ElectroWave Challenge Winner – CS Skill Up Series 2.0",
        "date": "Aug 2025",
        "description": "Krishna Gupta won the ElectroWave electronics challenge under IEEE’s Skill Up Series 2.0, showcasing creativity, problem-solving, and technical excellence."
      },
      {
        "title": "GATE Series Session with Vivek Pawar – IEEE RGIPT SB",
        "date": "6th Sep 2025",
        "description": "IEEE RGIPT SB’s GATE Series features Vivek Pawar, GATE CS AIR 60 and ML Engineer at Qualcomm, sharing strategies, insights, and guidance for GATE preparation."
      },
      {
        "title": "GATE Series Session with Bhawna Jain – IEEE RGIPT SB",
        "date": "7th Sep 2025",
        "description": "IEEE RGIPT SB’s GATE Series hosts Bhawna Jain, GATE EE’24 AIR 41 and Scientist at BARC, sharing preparation strategies, tips, and inspiration for GATE aspirants."
      },
      {
        "title": "GATE Series Session with Divyansh Tripathi – IEEE RGIPT SB",
        "date": "13th Sep 2025",
        "description": "IEEE RGIPT SB’s GATE Series features Divyansh Tripathi, GATE DS & AI AIR 75, sharing strategies, AI/DS project insights, and preparation tips for GATE aspirants."
      },
      {
        "title": "Signal Processing Session with Anirudh Roy – IEEE RGIPT SB",
        "date": "14th Sep 2025",
        "description": "IEEE RGIPT SB presents Anirudh Roy, PhD Scholar at Purdue University, sharing expertise in mixed-signal SoC design, Delta Sigma ADCs, and advanced signal processing techniques."
      }
    ]
  }
}
